Revit 2026 API

# StructuralSectionUtils Class

---

This class provides utilities related to Structural Section Properties.

SystemObject Autodesk.Revit.DB.Structure.StructuralSectionsStructuralSectionUtils

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class StructuralSectionUtils
```
```vb
Public NotInheritable Class StructuralSectionUtils
```
```cpp
public ref class StructuralSectionUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralSectionUtils = class end
```

The StructuralSectionUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetStructuralElementDefinitionData | Return structural element definition data. |
|  | GetStructuralSection | Return structural section from element. |
|  | SetStructuralSection | Set structural section in element. |

#### Reference

Autodesk.Revit.DB.Structure.StructuralSections Namespace